# -*- org-confirm-babel-evaluate: nil -*-
#+OPTIONS: ^:nil

* No session
   :PROPERTIES:
   :ID:       036292ac-5694-4788-bd0e-eeecb4820020
   :END:
** return type
   :PROPERTIES:
   :ID:       ee0cb5b4-7d0a-45a1-a683-edb69367c84f
   :END:
   #+NAME: ns-rt-value
   #+BEGIN_SRC coffee :results value
     'ob-coffee'
   #+END_SRC

   #+NAME: ns-rt-output
   #+BEGIN_SRC coffee :results output
     console.log 'ob-coffee'
   #+END_SRC

** variable
   :PROPERTIES:
   :ID:       79274f81-96fa-4230-8846-b29113a82c89
   :END:

    #+NAME: ns-variable-int
    #+BEGIN_SRC coffee :results value :var x=5
      x
    #+END_SRC

    #+NAME: ns-variable-str
    #+BEGIN_SRC coffee :results value :var str="ob-coffee"
      str
    #+END_SRC

    #+NAME: ns-variable-list
    #+BEGIN_SRC coffee :results value silent :var list='("a" "b" "c")
      list
    #+END_SRC

    #+NAME: num-tb
    | 1 | 2 |
    |---+---|
    | 3 | 4 |

    #+NAME: ns-variable-tb
    #+BEGIN_SRC coffee :results value :var tb=num-tb :colnames no
      tb
    #+END_SRC

    #+NAME: ns-multi-variables
    #+BEGIN_SRC coffee :results value :var x=3 y=4 z=5
      x+y+z
    #+END_SRC

* session
   :PROPERTIES:
   :ID:       892f52bf-35e2-4929-9c3d-43dd0c59cd53
   :END:

** return type
   :PROPERTIES:
   :ID:       88b0c507-4973-44f9-9960-7ac681229567
   :END:
   #+NAME: is-rt-value
   #+BEGIN_SRC coffee :session :results value
     'ob-coffee'
   #+END_SRC

   #+NAME: is-rt-output
   #+BEGIN_SRC coffee :session :results output
     console.log 'ob-coffee'
   #+END_SRC

** variable
   :PROPERTIES:
   :ID:       79274f81-96fa-4230-8846-b29113a82c89
   :END:

    #+NAME: is-variable-int
    #+BEGIN_SRC coffee :session :results value :var x=5
      x
    #+END_SRC

    #+NAME: is-variable-str
    #+BEGIN_SRC coffee  :session :results value :var str="ob-coffee"
      str
    #+END_SRC

    #+NAME: is-variable-list
    #+BEGIN_SRC coffee :session :results value :var list='("a" "b" "c")
      list
    #+END_SRC

    #+NAME: num-tb
    | 1 | 2 |
    |---+---|
    | 3 | 4 |

    #+NAME: is-variable-tb
    #+BEGIN_SRC coffee :session :results value :var tb=num-tb :colnames no
      tb
    #+END_SRC

    #+NAME: is-multi-variables
    #+BEGIN_SRC coffee :session :results value :var x=3 y=4 z=5
      x+y+z
    #+END_SRC

    #+NAME: is-share-variable
    #+BEGIN_SRC coffee :session :results output
    square = (x) -> x * x
    console.log square x
    #+END_SRC

* Test
  :PROPERTIES:
  :ID:       c4e351f8-7556-4e08-a093-f9feb4bedcba
  :END:

  #+NAME: ob-coffee-tests
  | functionality                       | block              | arg | expected  | results   | pass |
  |-------------------------------------+--------------------+-----+-----------+-----------+------|
  | return-type   : no session value    | ns-rt-value        |     | ob-coffee | ob-coffee | pass |
  | return-type   : no session output   | ns-rt-output       |     | ob-coffee | ob-coffee | pass |
  | variable-int  : no session          | ns-variable-int    |     | 5         | 5         | pass |
  | variable-str  : no session          | ns-variable-str    |     | ob-coffee | ob-coffee | pass |
  | variable-list : no session          | ns-variable-list   |     | a,b,c     | a,b,c     | pass |
  | variable-tb   : no session          | ns-variable-tb     |     | 1,2,3,4   | 1,2,3,4   | pass |
  | variable-multi: no session          | ns-multi-variables |     | 12        | 12        | pass |
  | return-type   : session base value  | is-rt-value        |     | ob-coffee | ob-coffee | pass |
  | return-type   : session base output | is-rt-output       |     | ob-coffee | ob-coffee | pass |
  | variable-int  : session base        | is-variable-int    |     | 5         | 5         | pass |
  | variable-str  : session base        | is-variable-str    |     | ob-coffee | ob-coffee | pass |
  | variable-list : session base        | is-variable-list   |     | a,b,c     | a,b,c     | pass |
  | variable-tb   : session base        | is-variable-tb     |     | 1,2,3,4   | 1,2,3,4   | pass |
  | variable-multi: session base        | is-multi-variables |     | 12        | 12        | pass |
  | session-share : session base        | is-share-variable  |     | 9         | 9         | pass |
  #+TBLFM: $5='(org-sbe $2) :: $6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))
